Revit 2026 API

# DuctSizeIterator Class

---

An iterator to a set of MEP duct sizes from DuctSizes.

SystemObject Autodesk.Revit.DB.MechanicalDuctSizeIterator

**Namespace:** Autodesk.Revit.DB.Mechanical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class DuctSizeIterator : IEnumerator<MEPSize>
```
```vb
Public Class DuctSizeIterator
	Implements IEnumerator(Of MEPSize)
```
```cpp
public ref class DuctSizeIterator : IEnumerator<MEPSize^>
```
```fsharp
type DuctSizeIterator =
    class
        interface IEnumerator<MEPSize>
    end
```

The DuctSizeIterator type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Current | Gets the item at the current position of the iterator. |
|  | CurrentObject |  |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |

|  | Name | Description |
| --- | --- | --- |
|  | Dispose | Releases all resources used by the DuctSizeIterator |
|  | Equals | Determines whether the specified object is equal to the current object.(Inherited from Object) |
|  | GetCurrent | Returns the current MEPSize. |
|  | GetHashCode | Serves as the default hash function.(Inherited from Object) |
|  | GetType | Gets the Type of the current instance.(Inherited from Object) |
|  | HasCurrent | Identifies if the iterator has a current item. |
|  | IsDone | Identifies if the iteration has completed. |
|  | MoveNext | Increments the iterator to the next item. |
|  | Reset | Resets the iterator to the initial state. |
|  | ToString | Returns a string that represents the current object.(Inherited from Object) |

#### Reference

Autodesk.Revit.DB.Mechanical Namespace